// pages/search/search.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    history_tag: ['头盔','摩托车','摩托车123','头盔2','头盔2','头盔2'],
    hotGoodsInfo: [
      {
        title: '重庆路宝宝奔雷名车131464611635重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
      {
        title: '重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
      {
        title: '重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
      {
        title: '重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
      {
        title: '重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
      {
        title: '重庆路宝宝奔雷名车131464611635',
        pirce: '59,000'
      },
    ],
    ifSearch: 0,   // 0 是未搜索， 1 是搜索结果
    recommend_tag: ['头盔123','摩托车312','摩托车0','头盔6','头盔7','头盔8'],
    searchResult: 0,  // 0 是没有搜索结果， 1 是有搜索结果
  },

  handleCancel() {
    console.log('111')
  },

})